# SparkSQL

In [1]:
import pyspark

sc = pyspark.SparkContext("local")
sqlContext = pyspark.SQLContext(sc)

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/12/01 03:41:02 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/12/01 03:41:02 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
23/12/01 03:41:02 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.
/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/pyspark/sql/context.py:113: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

In [2]:
data = [
    (1, 'a'), 
    (2, 'b'), 
    (3, 'c'), 
    (4, 'd'), 
    (5, 'e'), 
    (6, 'a'), 
    (7, 'b'), 
    (8, 'c'), 
    (9, 'd'), 
    (10, 'e')
]


df = sqlContext.createDataFrame(data, ['numbers', 'letters'])
df.toPandas()

   numbers letters
0        1       a
1        2       b
2        3       c
3        4       d
4        5       e
5        6       a
6        7       b
7        8       c
8        9       d
9       10       e

In [3]:
df.registerTempTable("mytable")
results = sqlContext.sql("select * from mytable")
results.toPandas()

/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/pyspark/sql/dataframe.py:329: FutureWarning: Deprecated in 2.0, use createOrReplaceTempView instead.
  warnings.warn("Deprecated in 2.0, use createOrReplaceTempView instead.", FutureWarning)

   numbers letters
0        1       a
1        2       b
2        3       c
3        4       d
4        5       e
5        6       a
6        7       b
7        8       c
8        9       d
9       10       e

In [4]:
results = sqlContext.sql("select * from mytable where numbers < 8 order by numbers desc")
results.toPandas()

   numbers letters
0        7       b
1        6       a
2        5       e
3        4       d
4        3       c
5        2       b
6        1       a

In [5]:
results = sqlContext.sql("select letters, count(*) as count, avg(numbers) as avg, sum(numbers) as sum from mytable group by letters")
results.toPandas()

  letters  count  avg  sum
0       e      2  7.5   15
1       d      2  6.5   13
2       c      2  5.5   11
3       b      2  4.5    9
4       a      2  3.5    7

#### Stop the Spark Context

In [6]:
sc.stop()